Model does not have a summary method, using torchsummary.
----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv1d-1             [32, 32, 1013]           1,600
       BatchNorm1d-2             [32, 32, 1013]              64
              ReLU-3             [32, 32, 1013]               0
            Conv1d-4             [32, 32, 1013]           5,120
       BatchNorm1d-5             [32, 32, 1013]              64
              ReLU-6             [32, 32, 1013]               0
            Conv1d-7             [32, 64, 1013]          10,240
       BatchNorm1d-8             [32, 64, 1013]             128
              ReLU-9             [32, 64, 1013]               0
        MaxPool1d-10              [32, 64, 507]               0
           Conv1d-11              [32, 64, 507]           4,096
      BatchNorm1d-12              [32, 64, 507]             128
             ReLU-13              [32, 64, 507]               0
           Conv1d-14              [32, 64, 507]          20,480
      BatchNorm1d-15              [32, 64, 507]             128
             ReLU-16              [32, 64, 507]               0
           Conv1d-17             [32, 256, 507]          16,384
      BatchNorm1d-18             [32, 256, 507]             512
           Conv1d-19             [32, 256, 507]          16,384
      BatchNorm1d-20             [32, 256, 507]             512
             ReLU-21             [32, 256, 507]               0
_XResNet1DBottleneckBlock-22             [32, 256, 507]               0
           Conv1d-23              [32, 64, 507]          16,384
      BatchNorm1d-24              [32, 64, 507]             128
             ReLU-25              [32, 64, 507]               0
           Conv1d-26              [32, 64, 507]          20,480
      BatchNorm1d-27              [32, 64, 507]             128
             ReLU-28              [32, 64, 507]               0
           Conv1d-29             [32, 256, 507]          16,384
      BatchNorm1d-30             [32, 256, 507]             512
             ReLU-31             [32, 256, 507]               0
_XResNet1DBottleneckBlock-32             [32, 256, 507]               0
           Conv1d-33              [32, 64, 507]          16,384
      BatchNorm1d-34              [32, 64, 507]             128
             ReLU-35              [32, 64, 507]               0
           Conv1d-36              [32, 64, 507]          20,480
      BatchNorm1d-37              [32, 64, 507]             128
             ReLU-38              [32, 64, 507]               0
           Conv1d-39             [32, 256, 507]          16,384
      BatchNorm1d-40             [32, 256, 507]             512
             ReLU-41             [32, 256, 507]               0
_XResNet1DBottleneckBlock-42             [32, 256, 507]               0
           Conv1d-43              [32, 64, 507]          16,384
      BatchNorm1d-44              [32, 64, 507]             128
             ReLU-45              [32, 64, 507]               0
           Conv1d-46              [32, 64, 254]          20,480
      BatchNorm1d-47              [32, 64, 254]             128
             ReLU-48              [32, 64, 254]               0
           Conv1d-49             [32, 256, 254]          16,384
      BatchNorm1d-50             [32, 256, 254]             512
        AvgPool1d-51             [32, 256, 254]               0
             ReLU-52             [32, 256, 254]               0
_XResNet1DBottleneckBlock-53             [32, 256, 254]               0
           Conv1d-54              [32, 64, 254]          16,384
      BatchNorm1d-55              [32, 64, 254]             128
             ReLU-56              [32, 64, 254]               0
           Conv1d-57              [32, 64, 254]          20,480
      BatchNorm1d-58              [32, 64, 254]             128
             ReLU-59              [32, 64, 254]               0
           Conv1d-60             [32, 256, 254]          16,384
      BatchNorm1d-61             [32, 256, 254]             512
             ReLU-62             [32, 256, 254]               0
_XResNet1DBottleneckBlock-63             [32, 256, 254]               0
           Conv1d-64              [32, 64, 254]          16,384
      BatchNorm1d-65              [32, 64, 254]             128
             ReLU-66              [32, 64, 254]               0
           Conv1d-67              [32, 64, 254]          20,480
      BatchNorm1d-68              [32, 64, 254]             128
             ReLU-69              [32, 64, 254]               0
           Conv1d-70             [32, 256, 254]          16,384
      BatchNorm1d-71             [32, 256, 254]             512
             ReLU-72             [32, 256, 254]               0
_XResNet1DBottleneckBlock-73             [32, 256, 254]               0
           Conv1d-74              [32, 64, 254]          16,384
      BatchNorm1d-75              [32, 64, 254]             128
             ReLU-76              [32, 64, 254]               0
           Conv1d-77              [32, 64, 254]          20,480
      BatchNorm1d-78              [32, 64, 254]             128
             ReLU-79              [32, 64, 254]               0
           Conv1d-80             [32, 256, 254]          16,384
      BatchNorm1d-81             [32, 256, 254]             512
             ReLU-82             [32, 256, 254]               0
_XResNet1DBottleneckBlock-83             [32, 256, 254]               0
           Conv1d-84              [32, 64, 254]          16,384
      BatchNorm1d-85              [32, 64, 254]             128
             ReLU-86              [32, 64, 254]               0
           Conv1d-87              [32, 64, 127]          20,480
      BatchNorm1d-88              [32, 64, 127]             128
             ReLU-89              [32, 64, 127]               0
           Conv1d-90             [32, 256, 127]          16,384
      BatchNorm1d-91             [32, 256, 127]             512
        AvgPool1d-92             [32, 256, 127]               0
             ReLU-93             [32, 256, 127]               0
_XResNet1DBottleneckBlock-94             [32, 256, 127]               0
           Conv1d-95              [32, 64, 127]          16,384
      BatchNorm1d-96              [32, 64, 127]             128
             ReLU-97              [32, 64, 127]               0
           Conv1d-98              [32, 64, 127]          20,480
      BatchNorm1d-99              [32, 64, 127]             128
            ReLU-100              [32, 64, 127]               0
          Conv1d-101             [32, 256, 127]          16,384
     BatchNorm1d-102             [32, 256, 127]             512
            ReLU-103             [32, 256, 127]               0
_XResNet1DBottleneckBlock-104             [32, 256, 127]               0
          Conv1d-105              [32, 64, 127]          16,384
     BatchNorm1d-106              [32, 64, 127]             128
            ReLU-107              [32, 64, 127]               0
          Conv1d-108              [32, 64, 127]          20,480
     BatchNorm1d-109              [32, 64, 127]             128
            ReLU-110              [32, 64, 127]               0
          Conv1d-111             [32, 256, 127]          16,384
     BatchNorm1d-112             [32, 256, 127]             512
            ReLU-113             [32, 256, 127]               0
_XResNet1DBottleneckBlock-114             [32, 256, 127]               0
          Conv1d-115              [32, 64, 127]          16,384
     BatchNorm1d-116              [32, 64, 127]             128
            ReLU-117              [32, 64, 127]               0
          Conv1d-118              [32, 64, 127]          20,480
     BatchNorm1d-119              [32, 64, 127]             128
            ReLU-120              [32, 64, 127]               0
          Conv1d-121             [32, 256, 127]          16,384
     BatchNorm1d-122             [32, 256, 127]             512
            ReLU-123             [32, 256, 127]               0
_XResNet1DBottleneckBlock-124             [32, 256, 127]               0
          Conv1d-125              [32, 64, 127]          16,384
     BatchNorm1d-126              [32, 64, 127]             128
            ReLU-127              [32, 64, 127]               0
          Conv1d-128              [32, 64, 127]          20,480
     BatchNorm1d-129              [32, 64, 127]             128
            ReLU-130              [32, 64, 127]               0
          Conv1d-131             [32, 256, 127]          16,384
     BatchNorm1d-132             [32, 256, 127]             512
            ReLU-133             [32, 256, 127]               0
_XResNet1DBottleneckBlock-134             [32, 256, 127]               0
          Conv1d-135              [32, 64, 127]          16,384
     BatchNorm1d-136              [32, 64, 127]             128
            ReLU-137              [32, 64, 127]               0
          Conv1d-138              [32, 64, 127]          20,480
     BatchNorm1d-139              [32, 64, 127]             128
            ReLU-140              [32, 64, 127]               0
          Conv1d-141             [32, 256, 127]          16,384
     BatchNorm1d-142             [32, 256, 127]             512
            ReLU-143             [32, 256, 127]               0
_XResNet1DBottleneckBlock-144             [32, 256, 127]               0
          Conv1d-145              [32, 64, 127]          16,384
     BatchNorm1d-146              [32, 64, 127]             128
            ReLU-147              [32, 64, 127]               0
          Conv1d-148               [32, 64, 64]          20,480
     BatchNorm1d-149               [32, 64, 64]             128
            ReLU-150               [32, 64, 64]               0
          Conv1d-151              [32, 256, 64]          16,384
     BatchNorm1d-152              [32, 256, 64]             512
       AvgPool1d-153              [32, 256, 64]               0
            ReLU-154              [32, 256, 64]               0
_XResNet1DBottleneckBlock-155              [32, 256, 64]               0
          Conv1d-156               [32, 64, 64]          16,384
     BatchNorm1d-157               [32, 64, 64]             128
            ReLU-158               [32, 64, 64]               0
          Conv1d-159               [32, 64, 64]          20,480
     BatchNorm1d-160               [32, 64, 64]             128
            ReLU-161               [32, 64, 64]               0
          Conv1d-162              [32, 256, 64]          16,384
     BatchNorm1d-163              [32, 256, 64]             512
            ReLU-164              [32, 256, 64]               0
_XResNet1DBottleneckBlock-165              [32, 256, 64]               0
          Conv1d-166               [32, 64, 64]          16,384
     BatchNorm1d-167               [32, 64, 64]             128
            ReLU-168               [32, 64, 64]               0
          Conv1d-169               [32, 64, 64]          20,480
     BatchNorm1d-170               [32, 64, 64]             128
            ReLU-171               [32, 64, 64]               0
          Conv1d-172              [32, 256, 64]          16,384
     BatchNorm1d-173              [32, 256, 64]             512
            ReLU-174              [32, 256, 64]               0
_XResNet1DBottleneckBlock-175              [32, 256, 64]               0
AdaptiveAvgPool1d-176               [32, 256, 1]               0
AdaptiveMaxPool1d-177               [32, 256, 1]               0
     BatchNorm1d-178                  [32, 512]           1,024
         Dropout-179                  [32, 512]               0
          Linear-180                    [32, 3]           1,539
================================================================
Total params: 888,643
Trainable params: 888,643
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 2.47
Forward/backward pass size (MB): 1415.25
Params size (MB): 3.39
Estimated Total Size (MB): 1421.11
----------------------------------------------------------------
