Model does not have a summary method, using torchsummary.
----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv1d-1            [32, 128, 1000]           2,048
              ReLU-2            [32, 128, 1000]               0
            Conv1d-3             [32, 20, 1000]          12,820
 AdaptiveAvgPool1d-4                [32, 20, 1]               0
           Flatten-5                   [32, 20]               0
            Linear-6                    [32, 3]              63
================================================================
Total params: 14,931
Trainable params: 14,931
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.37
Forward/backward pass size (MB): 67.39
Params size (MB): 0.06
Estimated Total Size (MB): 67.82
----------------------------------------------------------------
